## Population Analysis :

In [3]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np

In [4]:
df = pd.read_csv('C:/Users/Pandora/Downloads/population.csv')

In [5]:
df.head()

  Country Name Country Code       Year        Value
0   Arab World          ARB  8/25/1960   92496099.0
1   Arab World          ARB  8/25/1961   95036557.0
2   Arab World          ARB  8/25/1962   97663510.0
3   Arab World          ARB  8/25/1963  100380388.0
4   Arab World          ARB  8/25/1964  103191430.0

In [9]:
df.isnull().head()

   Country Name  Country Code   Year  Value
0         False         False  False  False
1         False         False  False  False
2         False         False  False  False
3         False         False  False  False
4         False         False  False  False

In [11]:
df_grpby_country = df.groupby(['Country Name','Country Code']).agg({'Value': 'sum'})

In [14]:
df_grpby_country.head()

                                    Value
Country Name   Country Code
Afghanistan    AFG           9.200843e+08
Albania        ALB           1.510417e+08
Algeria        DZA           1.356957e+09
American Samoa ASM           2.350424e+06
Andorra        AND           2.775198e+06

In [13]:
data_India = df.loc[df['Country Name'] =='India']
data_India.head(7)

     Country Name Country Code       Year        Value
7500        India          IND  8/25/1960  449661874.0
7501        India          IND  8/25/1961  458691457.0
7502        India          IND  8/25/1962  468054145.0
7503        India          IND  8/25/1963  477729958.0
7504        India          IND  8/25/1964  487690114.0
7505        India          IND  8/25/1965  497920270.0
7506        India          IND  8/25/1966  508402908.0

In [18]:
data_India.groupby(['Country Name','Country Code']).agg({'Value': 'sum'})

                                  Value
Country Name Country Code
India        IND           4.733409e+10

In [ ]:
data_India.plot(sta)